pjclavero/Diana/firmware/esp32/sdkconfig.defaults
# Valores por defecto de ESP-IDF para Diana (ESP32-S3).
#
#   idf.py set-target esp32s3
#   idf.py build flash monitor
#
# Este fichero es la base COMUN y esta pensada para poder construir y grabar hoy
# mismo sobre un devkit. Los ajustes de seguridad de produccion (firma de imagen
# y cifrado de NVS) NO estan aqui: viven en sdkconfig.defaults.prod porque
# requieren claves que no estan —ni deben estar— en el repositorio, y sin ellas
# el build falla. Para produccion:
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.prod" build

CONFIG_IDF_TARGET="esp32s3"

# --- Particiones (partitions.csv: OTA A/B + NVS + cola de eventos) ----------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
# 8 MB sirve para las dos variantes de devkit disponibles (N8R2 y N16R8): la
# tabla cabe entera en los primeros 8 MB, asi que el mismo binario vale para
# ambas. En el N16R8 los 8 MB restantes quedan sin usar.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# --- PSRAM: DESACTIVADA a proposito -----------------------------------------
# El N16R8 lleva PSRAM octal y el N8R2 la lleva quad: son configuraciones
# incompatibles, y arrancar con la equivocada cuelga el modulo. Como el firmware
# cabe de sobra en la RAM interna, desactivarla hace que un mismo binario
# arranque en ambas placas.
# Esto NO libera los GPIO 35-37: siguen cableados a la PSRAM dentro del modulo
# y no deben usarse.
CONFIG_SPIRAM=n

# --- Ethernet W5500 por SPI (dosier 8.3) ------------------------------------
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y
CONFIG_ETH_USE_ESP32_EMAC=n

# --- MQTT --------------------------------------------------------------------
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TASK_STACK_SIZE=6144

# --- Watchdog (dosier 8.2): obligatorio y con panic, no solo aviso ----------
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300

# --- Registro de fallos: volcado en flash para diagnosticar reinicios -------
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_SHA256=y

# --- OTA: rollback automatico si la imagen nueva no se confirma -------------
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_WDT_ENABLE=y
CONFIG_BOOTLOADER_WDT_TIME_MS=9000

# --- Reloj y temporizacion ---------------------------------------------------
# La resolucion de 1 ms del dosier 14.2 exige que la fuente monotonica sea
# esp_timer (1 us), no los ticks de FreeRTOS.
CONFIG_FREERTOS_HZ=1000

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
